src/export-files/Documents/ПриемНаРаботу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриемНаРаботу</Name>
			<Comment>Осуществить прием сотрудника на работу</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДвижениеСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСотрудников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗанимаемыхСтавок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/export-files/Documents/ПриемНаРаботу/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)
	ДанныеСотрудника = ПолучитьДанныеСотрудника(Элементы.СписокСотрудников.ТекущиеДанные.Сотрудник);
	ЗанестиДанныеСотрудника(ДанныеСотрудника);
	
	Элементы.СписокСотрудников.ТекущиеДанные.ДатаПриема = Объект.Дата; 
КонецПроцедуры

&НаКлиенте
Процедура ЗанестиДанныеСотрудника(ДанныеСотрудника)
	Если ЗначениеЗаполнено(ДанныеСотрудника.Подразделение) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.Подразделение = ДанныеСотрудника.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.Должность = ДанныеСотрудника.Должность;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСотрудника.ЗанимаемыхСтавок) Тогда
		Элементы.СписокСотрудников.ТекущиеДанные.ЗанимаемыхСтавок = ДанныеСотрудника.ЗанимаемыхСтавок;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеСотрудника(Сотрудник)
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Подразделение", Сотрудник.Подразделение);
	ДанныеСотрудника.Вставить("Должность", Сотрудник.Должность);
	ДанныеСотрудника.Вставить("ЗанимаемыхСтавок", Сотрудник.ЗанимаемыхСтавок);
	ДанныеСотрудника.Вставить("ЗанимаемыхСтавок", Сотрудник.ЗанимаемыхСтавок);
	Возврат ДанныеСотрудника;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Для Каждого СтрочкаСотрудник из Объект.СписокСотрудников Цикл
		ДанныеСотрудника = ПолучитьДанныеСотрудникаИзФормы(СтрочкаСотрудник);
		ЗаписатьДанныеНаСотрудника(СтрочкаСотрудник.Сотрудник, ДанныеСотрудника);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеСотрудникаИзФормы(Сотрудник)
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Подразделение", Сотрудник.Подразделение);
	ДанныеСотрудника.Вставить("Должность", Сотрудник.Должность);
	ДанныеСотрудника.Вставить("ЗанимаемыхСтавок", Сотрудник.ЗанимаемыхСтавок);
	Возврат ДанныеСотрудника;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеНаСотрудника(Сотрудник, ДанныеСотрудника)
	СотрудникСсылка = Сотрудник;
	СотрудникОбъект = СотрудникСсылка.ПолучитьОбъект();
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.Подразделение) Тогда
		СотрудникОбъект.Подразделение = ДанныеСотрудника.Подразделение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
		СотрудникОбъект.Должность = ДанныеСотрудника.Должность;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДанныеСотрудника.ЗанимаемыхСтавок) Тогда
		СотрудникОбъект.ЗанимаемыхСтавок = ДанныеСотрудника.ЗанимаемыхСтавок;
	КонецЕсли;
	
	СотрудникОбъект.СтатусСотрудника = Перечисления.СтатусыСотрудника.Работает;
	
	СотрудникОбъект.Записать();
КонецПроцедуры
